АлогистикТест2/src/Documents/алк_ВходящийТранспорт/алк_ВходящийТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВходящийТранспорт</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНесортированного</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагона</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВагонаВРег</name>
    <comment>Номер вагона/автомобиля</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладнойВрег</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазгрузкаСобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеНастройки/алк_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиНесортированного/алк_ОстаткиНесортированного.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиНесортированного</name>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.рфп_ОтгрузкаВагона</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВагона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперацииПроизводства</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Остатки</name>
  </enumValues>
  <enumValues>
    <name>Произведено</name>
  </enumValues>
  <enumValues>
    <name>Подано</name>
  </enumValues>
  <enumValues>
    <name>Получено</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Упаковано</name>
    <comment>Упаковано объема</comment>
  </enumValues>
  <enumValues>
    <name>Выход</name>
  </enumValues>
  <enumValues>
    <name>УпакованоШтук</name>
    <comment>Упаковано штук пакетов</comment>
  </enumValues>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование1</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование2</name>
  </enumValues>
  <enumValues>
    <name>Гранулирование3</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеНаКотельную</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырья</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЕль</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяЛиственница</name>
  </enumValues>
  <enumValues>
    <name>КРСПроизводства</name>
  </enumValues>
  <enumValues>
    <name>КРСОбщий</name>
  </enumValues>
  <enumValues>
    <name>ОстатокВСилосе</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеСырьяВсего</name>
  </enumValues>
  <enumValues>
    <name>ГранулированиеСреднее</name>
  </enumValues>
  <enumValues>
    <name>ПотреблениеКора</name>
  </enumValues>
  <enumValues>
    <name>ПоступилоНаБиржу</name>
    <comment>ВходящийТранспорт. Привезли еще не разгружался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСобственнымиСилами</name>
    <comment>ВходящийТранспортРазгрузили еще не сортировался</comment>
  </enumValues>
  <enumValues>
    <name>РазгруженоНаБиржеСиламиПодрядчика</name>
  </enumValues>
  <enumValues>
    <name>ПолученоСырьяПослеДробления</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ВходящийТранспорт/ManagerModule.bsl
#Область ИнициализацияДаных

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	СформироватьДвиженияОстаткиНесортированного(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьДвиженияОборотыПроизводства(ДокументСсылка, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура СформироватьДвиженияОборотыПроизводства(ДокументСсылка, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ВходящийТранспорт.ДатаРазгрузки КАК Период,
	|	алк_ВходящийТранспорт.Организация,
	|	алк_ВходящийТранспорт.Объем,
	|	ВЫБОР
	|		КОГДА алк_ВходящийТранспорт.РазгрузкаСобственнымиСилами
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСобственнымиСилами)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.РазгруженоНаБиржеСиламиПодрядчика)
	|	КОНЕЦ КАК Операция
	|ИЗ
	|	Документ.алк_ВходящийТранспорт КАК алк_ВходящийТранспорт
	|ГДЕ
	|	алк_ВходящийТранспорт.Ссылка = &Ссылка
	|	И 1 В
	|			(ВЫБРАТЬ
	|				1 КАК Поле1
	|			ИЗ
	|				РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаНесортированных"") КАК алк_ДополнительныеНастройкиСрезПоследних
	|			ГДЕ
	|				алк_ДополнительныеНастройкиСрезПоследних.Дата <= &Период)
	|	И НЕ алк_ВходящийТранспорт.ДатаРазгрузки = &ПустаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	алк_ВходящийТранспорт.Дата,
	|	алк_ВходящийТранспорт.Организация,
	|	алк_ВходящийТранспорт.Объем,
	|	ЗНАЧЕНИЕ(Перечисление.алк_ОперацииПроизводства.ПоступилоНаБиржу)
	|ИЗ
	|	Документ.алк_ВходящийТранспорт КАК алк_ВходящийТранспорт
	|ГДЕ
	|	алк_ВходящийТранспорт.Ссылка = &Ссылка
	|	И 1 В
	|			(ВЫБРАТЬ
	|				1 КАК Поле1
	|			ИЗ
	|				РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаНесортированных"") КАК алк_ДополнительныеНастройкиСрезПоследних
	|			ГДЕ
	|				алк_ДополнительныеНастройкиСрезПоследних.Дата <= &Период)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);  
	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	
	МассивРезультатов = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОборотыПроизводства", МассивРезультатов.Выгрузить());
КонецПроцедуры
Процедура СформироватьДвиженияОстаткиНесортированного(ДокументСсылка, СтруктураДополнительныеСвойства);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ВходящийТранспорт.Дата КАК Период,
	|	&ВидДвиженияПриход КАК ВидДвижения,
	|	алк_ВходящийТранспорт.Организация,
	|	алк_ВходящийТранспорт.СтруктурнаяЕдиница,
	|	алк_ВходящийТранспорт.Порода,
	|	алк_ВходящийТранспорт.НомерВагонаВРег Как НомерВагона,
	|	алк_ВходящийТранспорт.НомерНакладнойВРег Как НомерНакладной,
	|	алк_ВходящийТранспорт.Объем
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.алк_ВходящийТранспорт КАК алк_ВходящийТранспорт
	|ГДЕ
	|	алк_ВходящийТранспорт.Ссылка = &Ссылка
	|	И 1 В
	|			(ВЫБРАТЬ
	|				1 КАК Поле1
	|			ИЗ
	|				РегистрСведений.алк_ДополнительныеНастройки.СрезПоследних(, Параметр = ""ДатаНачалаУчетаНесортированных"") КАК алк_ДополнительныеНастройкиСрезПоследних
	|			ГДЕ
	|				алк_ДополнительныеНастройкиСрезПоследних.Дата <= &Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	алк_ОстаткиНесортированного.Регистратор,
	|	алк_ОстаткиНесортированного.НомерНакладной,
	|	алк_ОстаткиНесортированного.Объем
	|ПОМЕСТИТЬ ВТ_Движения
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиНесортированного КАК алк_ОстаткиНесортированного
	|ГДЕ
	|	алк_ОстаткиНесортированного.Регистратор = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Период,
	|	ВТ.ВидДвижения,
	|	ВТ.Организация,
	|	ВТ.СтруктурнаяЕдиница,
	|	ВТ.Порода,
	|	ВТ.НомерВагона,
	|	ВТ.НомерНакладной,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Движения.Объем, 0) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.ОбъемОстаток, 0) = 0
	|						ТОГДА ВТ.Объем
	|					ИНАЧЕ -алк_ОстаткиНесортированногоОстатки.ОбъемОстаток
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(алк_ОстаткиНесортированногоОстатки.ОбъемОстаток, 0) = 0
	|					ТОГДА ВТ_Движения.Объем
	|				ИНАЧЕ ВТ.Объем
	|			КОНЕЦ
	|	КОНЕЦ КАК Объем
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиНесортированного.Остатки(
	|				,
	|				(НомерВагона, НомерНакладной, Организация, Порода, СтруктурнаяЕдиница) В
	|					(ВЫБРАТЬ
	|						ВТ.НомерВагона,
	|						ВТ.НомерНакладной,
	|						ВТ.Организация,
	|						ВТ.Порода,
	|						ВТ.СтруктурнаяЕдиница
	|					ИЗ
	|						ВТ КАК ВТ)) КАК алк_ОстаткиНесортированногоОстатки
	|		ПО ВТ.НомерНакладной = алк_ОстаткиНесортированногоОстатки.НомерНакладной
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Движения КАК ВТ_Движения
	|		ПО ВТ.НомерНакладной = ВТ_Движения.НомерНакладной";
	
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);  
	Запрос.УстановитьПараметр("Период", ДокументСсылка.Дата);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиНесортированного", МассивРезультатов[2].Выгрузить());
КонецПроцедуры
#КонецОбласти
